Documents/ПередачаДолжников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПередачаДолжников</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Передачи</xr:Item>
				<xr:Item>InformationRegister.ПривязкаОтдел</xr:Item>
				<xr:Item>InformationRegister.ПривязкаСотрудник</xr:Item>
				<xr:Item>InformationRegister.Выезд</xr:Item>
				<xr:Item>InformationRegister.ПривязкаОтветственный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятиеОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередачаВСвободныйПул</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольОтдела</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольОтдела</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказПередачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПередачаДолжников/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийМенеджер = Константы.Менеджер.Получить();
	Об = РеквизитФормыВЗначение("Объект");
	Если Об.ЭтоНовый() Тогда
		Объект.Менеджер = ТекущийМенеджер;
		Объект.Автор = ПараметрыСеанса.Пользователь;
	КонецЕсли; 
	
	Элементы.Подписан.Доступность = ПараметрыСеанса.Администратор;
КонецПроцедуры

&НаКлиенте
Процедура ПередачаВСвободныйПулПриИзменении(Элемент)
	ОбновитьПредупреждение();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредупреждение()
	Если Объект.ПередачаВСвободныйПул Тогда
		Текст = "Внимание! При передаче в свободный пул будут сняты все текущие привязки должников.";
	Иначе	
		Текст = "";
	КонецЕсли; 
	
	Элементы.НадписьПредупреждение.Заголовок = Текст;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДолжников(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьТЧДолжники", ЭтотОбъект);	
	ОткрытьФорму("Обработка.ЗагрузкаДолжников.Форма.Форма",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧДолжники(Результат, ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		Для каждого строкаРезультата Из Результат Цикл
			НоваяСтрока = Объект.Должники.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, строкаРезультата);
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьТЧДоллжники()

&НаКлиенте
Процедура ОтказПередачи(Команда)
	Объект.Подписан = Ложь;
	Объект.ОтказПередачи = Истина;
	ЭтаФорма.Записать();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НапечататьКарточку(Команда)
	МассивДолжников = Новый Массив;
	ВыделенныеСтроки = Элементы.Должники.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() > 0 Тогда
		Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
			СтрокаДолжника = Объект.Должники.НайтиПоИдентификатору(ВыделеннаяСтрока);
			МассивДолжников.Добавить(СтрокаДолжника.Должник);
		КонецЦикла;
	Иначе
		МассивДолжников = Объект.Должники.Выгрузить("Должник");
	КонецЕсли;
	Для Каждого Должник Из МассивДолжников Цикл
		Если Должник.Пустая() Тогда
			Сообщить("Не выбран должник.");
			Возврат;	
		КонецЕсли; 
		
		Таблица = Новый ТабличныйДокумент;
		
		ЗаполнитьКарточкуНаСервере(Таблица, Должник);
		
		Таблица.Защита = Истина;
		Таблица.ТолькоПросмотр = Истина;
		Таблица.Показать("Карточка " + Строка(Должник));
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКарточкуНаСервере(Таблица, Знач ТекДолжник)
	
	ОбработкаОтчета = Отчеты.КарточкаДолжника.Создать();
	ОбработкаОтчета.Должник = ТекДолжник;
	ОбработкаОтчета.КарточкаДолжника(Таблица, ТекДолжник);
	
КонецПроцедуры
